#+title: Documenting exploration and modifications

* Git
#+begin_src shell
git branch
#+end_src

#+RESULTS:
: * dev-step-printing-reflects-memoization
:   main
:   step-printing-reflects-memoization

The ~step-printing-reflects-memoization~ is meant to be clean with only modifications required to run.
The ~dev~ version has this document and the addition of:
- ~Debug.log~ control, stack and heap when printing a step
- To reduce noise on browser's console
  - Disabled previous lines (since they are printed again)
  - Disabled prelude to make heap smaller
    - added just ~zipWith~ and ~tail~ to be able to do =fib= example

